# Missing Data frame
The first thing we are going to create a data frame missing contains missing data.

In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
import random

In [2]:
var1 = np.random.randn(21)
var1

array([ 0.2498122 , -1.70272689,  0.25408032,  1.07696991, -1.14073144,
       -2.55330187,  0.01400537, -1.22727933,  0.2548977 ,  0.06308152,
       -0.96855372, -0.46918993, -0.49529858, -1.23919515,  0.80623987,
       -0.403544  , -0.3406051 ,  0.60435145, -0.34557685, -0.64926088,
       -1.72847597])

* Creating a Table 7*3 with Null values

In [3]:
var1 = np.random.randn(21)
var1[random.sample([i for i in range(21)],5)]=np.nan
df = DataFrame(var1.reshape(7,3),columns = ["aaa","bbb","ccc"],index=['a','b','c','d','e','f','g'])
df

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
c       NaN -1.440948  0.259632
d -1.518375 -1.113080 -0.051216
e -0.379999  0.202407       NaN
f -1.801337       NaN       NaN
g -0.963518       NaN -0.139366

In [4]:
srs = Series([2,3,3,9,8,np.nan,4,4,5])
srs

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
5    NaN
6    4.0
7    4.0
8    5.0
dtype: float64

In [5]:
df

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
c       NaN -1.440948  0.259632
d -1.518375 -1.113080 -0.051216
e -0.379999  0.202407       NaN
f -1.801337       NaN       NaN
g -0.963518       NaN -0.139366

In [6]:
np.isnan(df)   #It displays the "null-values"  for "True"

     aaa    bbb    ccc
a  False  False  False
b  False  False  False
c   True  False  False
d  False  False  False
e  False  False   True
f  False   True   True
g  False   True  False

In [7]:
df.isnull()     #It displays "Null-values"  to "True"

     aaa    bbb    ccc
a  False  False  False
b  False  False  False
c   True  False  False
d  False  False  False
e  False  False   True
f  False   True   True
g  False   True  False

In [8]:
#opposite of isnull() and isnan()
df.notnull()          #It displays "Nuull-values"   to "False"

     aaa    bbb    ccc
a   True   True   True
b   True   True   True
c  False   True   True
d   True   True   True
e   True   True  False
f   True  False  False
g   True  False   True

# Heres what removing missing information looks like

In [9]:
df.dropna()             #It Removes if a single value is null ina row it removes entire column

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
d -1.518375 -1.113080 -0.051216

In [10]:
srs

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
5    NaN
6    4.0
7    4.0
8    5.0
dtype: float64

In [11]:
print(srs.dropna())

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
6    4.0
7    4.0
8    5.0
dtype: float64

# Now lets look at more intresting to filling missing information

In [12]:
srs

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
5    NaN
6    4.0
7    4.0
8    5.0
dtype: float64

In [13]:
xbar = srs.mean()        #By caliculating the "MEAN-value"
print(xbar)

4.75

In [14]:
print(srs.fillna(xbar))           #By caliculating the "MEAN-value" replace to the null value

0    2.00
1    3.00
2    3.00
3    9.00
4    8.00
5    4.75
6    4.00
7    4.00
8    5.00
dtype: float64

In [15]:
print(srs.fillna(0))          #Removing the "Float" integers

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
5    0.0
6    4.0
7    4.0
8    5.0
dtype: float64

In [16]:
#how does the mean compar of this befor?
srs.fillna(xbar).mean()

4.75

In [17]:
#what about the standard deviation(a measure of how dispersed data is)?
srs.std()

2.49284690951645

In [18]:
srs.fillna(xbar).std()

2.331844763272204

# Step :1   
* Replacing missing values with "MEAN"

* Filling missing data with the mean of the data is not cost-free;while the mean is preserved,other important metrics (such as the standard devation)are affected;which may contaminate some algorithm (we made the data appear more concentrated than the original data was).

* Heres trick:replace the data with randomly generatd data with the same mean and standard devation as the original data.we may pick random values from our data set and fill missing data those values.this resembels a statical technique know as "BOOTSTRAPPIN".

* I demonstrate below.

# Step : 2
* Replacing missing values with random generated number is called as "BOOTSTRAPPING"

In [19]:
rep = Series(np.random.choice(srs[srs.notnull()],size=2),index=[5,7])
print(rep)         #It displays the random genrated number

5    3.0
7    2.0
dtype: float64

In [20]:
s = srs.std()
#Genrate a numpy ndarray filled with randomly generated data,of the same length as the missing data
rep = Series(np.random.choice(srs[srs.notnull()],size=2),index=[5,7])
print(rep)

5    4.0
7    3.0
dtype: float64

In [21]:
srs.fillna(rep)

0    2.0
1    3.0
2    3.0
3    9.0
4    8.0
5    4.0
6    4.0
7    4.0
8    5.0
dtype: float64

In [22]:
srs.fillna(rep).mean()

4.666666666666667

In [23]:
srs.fillna(rep).std()

2.3452078799117144

# Step :3 Normal distribution

* While random the mean and standard devation of the filled-in data set are both close to that of the original data set.(not that this approach is perfect either why the "NORMAL DISTRIBUTION"?)

In [24]:
df

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
c       NaN -1.440948  0.259632
d -1.518375 -1.113080 -0.051216
e -0.379999  0.202407       NaN
f -1.801337       NaN       NaN
g -0.963518       NaN -0.139366

In [25]:
df.fillna(0)

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
c  0.000000 -1.440948  0.259632
d -1.518375 -1.113080 -0.051216
e -0.379999  0.202407  0.000000
f -1.801337  0.000000  0.000000
g -0.963518  0.000000 -0.139366

In [26]:
df.mean()

aaa   -0.808660
bbb   -0.166268
ccc    0.122377
dtype: float64

In [27]:
df.fillna(df.mean())

        aaa       bbb       ccc
a -0.020502  1.587913  0.609560
b -0.168227 -0.067632 -0.066726
c -0.808660 -1.440948  0.259632
d -1.518375 -1.113080 -0.051216
e -0.379999  0.202407  0.122377
f -1.801337 -0.166268  0.122377
g -0.963518 -0.166268 -0.139366

In [28]:
df.std()

aaa    0.738672
bbb    1.198339
ccc    0.312486
dtype: float64

In [29]:
df.fillna(df.mean()).std()  #All Standard devation go down

aaa    0.674312
bbb    0.978439
ccc    0.255144
dtype: float64

* What does the  fill with random data "trick used above look like here?

# If we try the Boootstrap

In [30]:
col='aaa'
df[col][df[col].notnull()]

a   -0.020502
b   -0.168227
d   -1.518375
e   -0.379999
f   -1.801337
g   -0.963518
Name: aaa, dtype: float64

# We will fill the missing data via a dict

In [31]:
#rep_df = ({col:Series(np.random.choice(df[col][df[col].notnull()],size=df.isnull()[col].value_counts()[True]),index=df[col][df[col].isnull()].index),for col in df})
#rep_df

In [32]:
#df.fillna(rep_df)

In [33]:
#df.fillna(rep_df).mean()

In [34]:
#df.fillna(rep_df).std()

#### As you encounter diffrent problems you may come upon other solutions to filling in missing values.Here are some examples.

# For Numeric Data:
* 1.Fill in with a 'netural value like 0,1,or sample mean
* 2.Fill with taylored values to preserve select statistics(like the mean or standard devation),randomly assigned to rows
* 3.Fill with independentaly generated random numbers ith same stasistic propertices as the data.

# For categories data
* 1.Fill with most common values
* 2.Fill with values choosen with a frequency that would preserve observed frequencie,randomly assigne to rows
* 3.Fill with independently generated random values chosen with the same frequency as the observed frequencie

# None of the even covers imputation Theres many ways o fill missing values.

# Sorting and Ranking

In [35]:

df1 = DataFrame(np.round(np.random.randn(7,3) * 10),
                 columns=["aaa","bbb","ccc"],
                 index=list("defcabg"))
df1

    aaa   bbb   ccc
d   3.0   6.0  17.0
e -10.0   9.0 -15.0
f  10.0  -2.0   2.0
c  -1.0  18.0  -7.0
a   8.0  22.0 -27.0
b  -4.0  15.0  10.0
g  -0.0  -9.0  21.0

In [36]:
#sorting index    # It re-arrange "Rows"
df1.sort_index()

    aaa   bbb   ccc
a   8.0  22.0 -27.0
b  -4.0  15.0  10.0
c  -1.0  18.0  -7.0
d   3.0   6.0  17.0
e -10.0   9.0 -15.0
f  10.0  -2.0   2.0
g  -0.0  -9.0  21.0

In [37]:
#Sorting colums by
#index,opposite
#order
df1.sort_index(axis=1,ascending=False)

    ccc   bbb   aaa
d  17.0   6.0   3.0
e -15.0   9.0 -10.0
f   2.0  -2.0  10.0
c  -7.0  18.0  -1.0
a -27.0  22.0   8.0
b  10.0  15.0  -4.0
g  21.0  -9.0  -0.0

In [38]:
#the content of "aaa"
df1.sort_values(by='aaa')

    aaa   bbb   ccc
e -10.0   9.0 -15.0
b  -4.0  15.0  10.0
c  -1.0  18.0  -7.0
g  -0.0  -9.0  21.0
d   3.0   6.0  17.0
a   8.0  22.0 -27.0
f  10.0  -2.0   2.0

In [39]:
#arrange first by bbb
#breaking ties with ccc
df1.sort_values(by=['bbb','ccc'])

    aaa   bbb   ccc
g  -0.0  -9.0  21.0
f  10.0  -2.0   2.0
d   3.0   6.0  17.0
e -10.0   9.0 -15.0
b  -4.0  15.0  10.0
c  -1.0  18.0  -7.0
a   8.0  22.0 -27.0

In [40]:
#ranking is much diffrent from sorting

In [41]:
df1.rank()

   aaa  bbb  ccc
d  5.0  3.0  6.0
e  1.0  4.0  2.0
f  7.0  2.0  4.0
c  3.0  6.0  3.0
a  6.0  7.0  1.0
b  2.0  5.0  5.0
g  4.0  1.0  7.0

In [42]:
df1.rank(method='max')

   aaa  bbb  ccc
d  5.0  3.0  6.0
e  1.0  4.0  2.0
f  7.0  2.0  4.0
c  3.0  6.0  3.0
a  6.0  7.0  1.0
b  2.0  5.0  5.0
g  4.0  1.0  7.0

# Hierarchical index

In [43]:
#multiple index
midx = pd.MultiIndex([['a','b'],['alpha','beta'],[1,2]],
                    [[0,0,0,0,1,1,1,1],
                     [0,0,1,1,0,0,1,1],
                     [0,1,0,1,0,1,0,1]])
Series(np.arange(8),index=midx)

a  alpha  1    0
          2    1
   beta   1    2
          2    3
b  alpha  1    4
          2    5
   beta   1    6
          2    7
dtype: int32

In [44]:
#in the series creation
srs = Series(np.arange(8),
            index = [['a','a','a','a','b','b','b','b'],
                    ['alpha','alpha','beta','beta',
                    'alpha','alpha','beta','beta'],
                     [1,2,1,2,1,2,1,2]])
srs

a  alpha  1    0
          2    1
   beta   1    2
          2    3
b  alpha  1    4
          2    5
   beta   1    6
          2    7
dtype: int32

In [45]:
srs.loc['b']

alpha  1    4
       2    5
beta   1    6
       2    7
dtype: int32

In [46]:
srs.loc['b','alpha'] #the following wont work for data frame

1    4
2    5
dtype: int32

In [47]:
srs.loc['b','alpha',1]

4

In [48]:
srs.loc['a',:,1]

a  alpha  1    0
   beta   1    2
dtype: int32

In [49]:
df3 = DataFrame(np.random.randn(8,3),index=midx,
               columns=['aaa','bbb','ccc'])
df3.loc['b']

              aaa       bbb       ccc
alpha 1 -0.886087  1.620152 -1.219165
      2 -0.055096  0.078175  0.207526
beta  1 -1.246790  2.329500  0.636258
      2  0.841288  0.335985  0.858175

In [50]:
df3.loc[('b','alpha')]  #must use a tuple here

        aaa       bbb       ccc
1 -0.886087  1.620152 -1.219165
2 -0.055096  0.078175  0.207526

In [51]:
df3.loc[('b','alpha',1)]

aaa   -0.886087
bbb    1.620152
ccc   -1.219165
Name: (b, alpha, 1), dtype: float64

In [52]:
df3.loc[('b',slice(None),1),:]  #dont treat : as optional

                aaa       bbb       ccc
b alpha 1 -0.886087  1.620152 -1.219165
  beta  1 -1.246790  2.329500  0.636258

In [53]:
df3.loc[(slice(None,'b'),slice(None),1),['aaa','bbb']]

                aaa       bbb
a alpha 1  1.753858 -0.188573
  beta  1 -1.085288  0.493347
b alpha 1 -0.886087  1.620152
  beta  1 -1.246790  2.329500

In [54]:
df3.loc[(slice(None),slice(None),1),['ccc']]

                ccc
a alpha 1 -0.251437
  beta  1  1.659731
b alpha 1 -1.219165
  beta  1  0.636258